{"Black Panther": {"name": "Black Panther", "rating": "4", "description": "Follows T'Challa who, after the death of his father, the King who of Wakanda, returns home to the isolated, technologically advanced African nation to succeed to the throne and take his rightful place as king. But when a powerful old enemy reappears, T'Challa's mettle as king and Black Panther is tested when he is drawn into a formidable conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people and their way of life.", "image": "black_panther.png"}, "Avengers": {"name": "Avengers", "rating": "5", "description": "After half of all life is snapped away by Thanos, the Avengers are left scattered and divided. Now with a way to reverse the damage, the Avengers and their allies must assemble once more and learn to put differences aside in order to work together and set things right. Along the way, the Avengers realize that sacrifices must be made as they prepare for the ultimate final showdown with Thanos, which will result in the heroes fighting the biggest battle they have ever faced.", "image": "avengers.png"}, "A river Runs Through It": {"name": "A river Runs Through It", "rating": "5", "description": "The Maclean brothers, Paul and Norman, live a relatively idyllic life in rural Montana, spending much of their time fly fishing. The sons of a minister, the boys eventually part company when Norman moves east to attend college, leaving his rebellious brother to find trouble back home. When Norman finally returns, the siblings resume their fishing outings, and assess both where they've been and where they're going. ", "image": "a_river_runs_through_it.png"}, "The Secret Life Of Walter Mitty": {"name": "The Secret Life Of Walter Mitty", "rating": "5", "description": "The manager of the negative assets sector of Life magazine, Walter Mitty, has been working for sixteen years for the magazine and has a tedious life, not going anywhere but from his home to his job and vice-versa. He is an escapist, daydreaming into a world of fantasy many times a day. Walter has a crush on the recently hired Cheryl Melhoff but he is too shy to invite her on a date and he is trying to contact her via online dating. The magazine is preparing to release its last printed edition and the loathsome manager of transition Ted Hendricks is preparing an inevitable downsizing over the next few days.", "image": "secret_life_of_walter_mitty.png"}, "Wish I Was Here": {"name": "Wish I Was Here", "rating": "3", "description": "'Wish I Was Here' is the story of Aidan Bloom, a struggling actor, father and husband, who at 35 is still trying to find his identity; a purpose for his life. He winds up trying to home school his two children when his father can no longer afford to pay for private education and the only available public school is on its last legs. Through teaching them about life his way, Aidan gradually discovers some of the parts of himself he couldn't find. ", "image": "wish_i_was_here.png"}, "Jerry Maguire": {"name": "Jerry Maguire", "rating": "5", "description": "Jerry Maguire (Tom Cruise) is a successful sports agent. The biggest clients, the respect, a beautiful fiancée, he has it all. Until one night he questions his purpose. His place in the world, and finally comes to terms with what's wrong with his career and life. Recording all of his thoughts in a mission statement, Jerry feels he has a new lease on life. Unfortunately his opinions aren't met with enthusiasm from his superiors and after dishonorably being stripped of his high earning clients and elite status within the agency, Jerry steps out into the sports business armed with only one volatile client, Rod Tidwell (Cuba Gooding, Jr.), and the only person with belief in his abilities, Dorothy Boyd (Renée Zellweger), with the impossible task of rebuilding what he once had.", "image": "jerry_maguire.png"}}